## Сервис мгновенных платежей (Корпоративное web приложение)

**Функциональные требования**
 - пользователи могут создавать счета
 - пополнять счет
 - снимать со счета
 - переводить деньги между разными счетами
 - у переводов может быть указана категория
Дополнительно:
 - в зависимости от категории может начисляться разный кэшбэк
 - администратор может указывать размер (процент) кэшбэка для каждой категории

**Технические требования**
 - scala
 - postgres
 - docker
 - приложение должно разворачиваться одной командой
 - интерфейс взаимодействия с пользователем - rest api
 - код приложения демонстрируется на githib.com